Repository: loginom/loginom-l10n-omegat
Catalog: omegat/project_save.tmx
Source language: ru
Languages: en

source: Дата - аргумент типа Дата/Время. Количество_Интервалов - количество интервалов заданного типа, составляющих интервал; целое положительное число. Тип_Интервала - тип временного интервала. Начальная_Точка - аргумент типа Дата/Время, от которого начинают отсчитываться временные интервалы. Тип_Интервала может принимать следующие значения: "Year" - интервал задан в годах (начало отсчёта по умолчанию - 0 год); "Quarter" - интервал задан в кварталах (начало отсчёта по умолчанию - первый квартал 1 года); "Month" - интервал задан в месяцах (начало отсчёта по умолчанию - январь 1 года); "Week" - интервал задан в неделях (начало отсчёта по умолчанию - 1 января 1900 года); "Day" - интервал задан в днях (начало отсчёта по умолчанию - 30 декабря 1899 года); "Hour" - интервал задан в часах (начало отсчёта по умолчанию - полночь 30 декабря 1899 года); "Minute" - интервал задан в минутах (начало отсчёта по умолчанию - полночь 30 декабря 1899 года); "Second" - интервал задан в секундах (начало отсчёта по умолчанию - полночь 30 декабря 1899 года).
en: Date - a Date/Time type argument. Interval_Count - the number of the given type intervals included in the interval; a positive integer number. Interval_Type - the type of the time interval. Starting_Point - a Date/Time argument with which the counting of time intervals starts. Interval_Type can assume the following values: "Year" - the interval is set in years (starting with year 0 by default); "Quarter" - the interval is set in quarters (starting with the first quarter of year 1 by default); "Month" - the interval is set in months (starting with January of year 1 by default); "Week" - the interval is set in weeks (starting with January 1, 1900 by default); "Day" - the interval is set in days (starting with December 30, 1899 by default); "Hour" - the interval is set in hours (starting with 00:00 December 30, 1899 by default); "Minute" - the interval is set in minutes (starting with 00:00 December 30, 1899 by default); "Second" - the interval is set in seconds (starting with 00:00 December 30, 1899 by default).

source: ИмяПоля - имя поля, данные которого необходимо получить НомерСтроки - номер строки, значение которой необходимо получить. Нумерация строк начинается с 0.
en: FieldName - the name of the field to retrieve data from RowNumber - the number of the row from which to retrieve the value. Row numbering starts from 0.

source: StartOfInterval(Дата, Количество_Интервалов, Тип_Интервала[, Начальная_Точка])
en: StartOfInterval(Date, Interval_Count, Interval_Type[, Starting_Point])

source: Функция возвращает начало указанного временного интервала. Продолжительность интервала определяется параметрами Тип_Интервала и Количество_Интервалов. Если параметр Начальная_Точка задан, то интервалы отсчитываются от начала интервала заданного типа, к которому относится Начальная_Точка. Например, если Тип_Интервала - месяц, а Начальная_Точка - 15 ноября 2023 года, то интервалы будут рассчитаны относительно 1 ноября 2023 года
en: The function returns the beginning of a specified time interval. The interval's length is defined by the parameters Interval_Type and Interval_Count. If the Starting_Point parameter is set, the intervals are counted starting with the beginning of the interval to which the Starting_Point belongs. For example, if Interval_Type is month and Starting_Point is November 15, 2023, the intervals will be calculated starting from November 1, 2023

source: StartOfTheMonth(Дата)
en: StartOfTheMonth(Date)

source: Функция возвращает дату начала месяца, указанного в Дата
en: The function returns the first date of the month specified in Date

source: StartOfTheQuarter(Дата)
en: StartOfTheQuarter(Date)

source: Функция возвращает дату начала квартала, к которому относится указанная Дата
en: The function returns the first date of the quarter to which the specified Date belongs

source: StartOfTheWeek(Дата)
en: StartOfTheWeek(Date)

source: Data("ИмяПоля",НомерСтроки)
en: Data("FieldName",RowNumber)

source: Функция возвращает дату начала указанной недели в соответствии со стандартом ISO 8601, по которому неделя начинается с понедельника и заканчивается воскресеньем.
en: Function returns the date of the specified week start according to ISO 8601 standard subject to which the week starts from Monday and ends with Sunday.

source: StartOfTheYear(Дата)
en: StartOfTheYear(Date)

source: Функция возвращает дату начала года, указанного в Дата
en: The function returns the first date of the year specified in Date

source: StdDev(Аргумент1, Аргумент2 ...)
en: StdDev(Argument1, Argument2 ...)

source: Возвращает стандартное отклонение аргументов.
en: Returns the standard deviation of arguments.

source: Аргумент - выражение числового типа.
en: Argument - expression of the numeric type.

source: Str(Аргумент)
en: Str(Argument)

source: Возвращает строковое представление Аргумента с учётом локали.
en: Returns a locale-aware string representation of the Argument.

source: Функция возвращает значение поля ИмяПоля взятое из строки НомерСтроки. При рекурсивном использовании данной функции необходимо в окне "Параметры выражения" установить флаг "Кэшировать". Примечание: ИмяПоля - строковое значение, т.е. явно заданное ИмяПоля должно быть указано в кавычках. Например: Data("COL1", 2)
en: Function returns the FieldName field value taken from the RowNumber row. In case of the recursive usage of this function, the "Cache" checkbox in the "Expression parameters" window must be marked. Note: FieldName is a string value, therefore, an explicitly given FieldName must be put in quotes. For example, Data("COL1", 2)

source: Аргумент - строковое выражение, содержащее дату/время Формат - необязательный параметр формат даты/время в терминах D, M, Y, H, N, S, Z
en: Argument - the string expression containing date/time Format - optional parameter date/time format in terms of D, M, Y, H, N, S, Z

source: StrToDate(Аргумент [, Формат])
en: StrToDate(Argument [, Format])

source: Функция конвертирует строку, содержащую дату в формат типа "Дата/Время". Примеры формата: "DD.MM.YY" - определяет, что Аргумент содержит строки вида "25.12.04"; "DD/MM/YY HH:NN:SS" - определяет, что Аргумент содержит строки вида "25/12/04 12:44:54";
en: Function converts the string containing the date into the "Date/Time" format. The format examples: "DD.MM.YY" - defines that the Argument contains strings of the following type: "25.12.04"; "DD/MM/YY HH:NN:SS" - defines that the Argument contains strings of the following type: "25/12/04 12:44:54";

source: Выражение - числовое выражение. Общая_длина - длина результирующей строки
en: Expression - numeric expression. Total_length - length of the resulting string

source: StrZero(Выражение, Общая_длина)
en: StrZero(Expression, Total_length)

source: Добавляет спереди заданного выражения нули так, чтобы длина результирующей строки равнялась Общей_длине.
en: Adds zeros at the front of the specified expression so that the resulting string length is equal to the Total_length.

source: Источник - строковое выражение. Вставляемая_строка - строковое выражение. Начало - позиция начала вставки Длина - длина удаляемой подстроки
en: Source - string expression. Inserted_string - string expression. Start - position of the insert start Length - length of the deleted substring

source: Stuff(Источник, Начало, Длина [, Вставляемая_строка = ""])
en: Stuff(Source, Start, Length [, Inserted_string = ""])

source: Возвращает строку следующего вида. Сначала из Источника удаляется подстрока, начиная с позиции Начало длиной Длина. Затем на место удаленной подстроки вставляется Вставляемая_строка.
en: Returns the string of the following type. At first, substring is deleted from the Source, starting from the Start position of the Length length. Then instead of the deleted substring, the Inserted_string is inserted.

source: Источник - строковое выражение. Начало - позиция начало подстроки Длина - длина подстроки
en: Source - string expression. Start - position of the substring start Length - the substring length

source: ИмяПоля - имя поля, переменной или выражения
en: FieldName - name of field, variable or expression

source: SubStr(Источник, Начало, Длина)
en: SubStr(Source, Start, Length)

source: Возвращает подстроку из строки - источника, начиная с позиции Начало длиной Длина.
en: Returns substring from string - source, starting from the Start position of the Length length.

source: Sum(Аргумент1, Аргумент2 ...)
en: Sum(Argument1, Argument2 ...)

source: Возвращает сумму аргументов.
en: Returns the sum of arguments.

source: SumSq(Аргумент1, Аргумент2 ...)
en: SumSq(Argument1, Argument2 ...)

source: Возвращает сумму квадратов аргументов.
en: Returns the sum of squared arguments.

source: Tan(Угол)
en: Tan(Angle)

source: DisplayName(["ИмяПоля"])
en: DisplayName(["FieldName"])

source: Возвращает тангенс заданного угла.
en: Returns the tangent of the set angle.

source: Возвращает текущую дату. Так как текущая дата - это дата вычисления выражения, которое считается каждый раз при получении значения этого выражения, например, при просмотре результата в виде таблицы или при выполнении экспорта данных, то можно, при наличии параметра выражения "Кэшировать" включить эту опцию.
en: Returns the current date. The current date is the date the expression gets calculated, and it is calculated each time the expression's value is retrieved, for example, when viewing results in a tabular form or exporting data. Thus, it is generally recommended to enable the "Cache" expression parameter when it is available.

source: Trim(Аргумент)
en: Trim(Argument)

source: Возвращает Аргумент без ведущих и ведомых пробелов, а также символов с кодом меньше 32.
en: Returns the Argument without leading and trailing spaces and characters with the code less than 32.

source: TrimLeft(Аргумент)
en: TrimLeft(Argument)

source: Возвращает Аргумент без ведущих пробелов, а также символов с кодом меньше 32.
en: Returns the Argument without leading spaces and characters with the code less than 32.

source: Функция возвращает метку (отображаемое имя) по имени поля, переменной или выражения. Если функция вызывается без аргументов, то она возвращает метку текущего вычисляемого выражения. Примечание: ИмяПоля - строковое значение, т.е. явно заданное ИмяПоля должно быть указано в кавычках. Например: DisplayName("COL1")
en: Function returns the caption (display name) according to the field name, variable or expression. If the function is called without arguments, it returns the caption of the current calculated expression. Note: FieldName - the string value, namely, the explicitly given FieldName must be specified in quotation marks. For example: DisplayName("COL1")

source: TrimRight(Аргумент)
en: TrimRight(Argument)

source: Возвращает Аргумент без ведомых пробелов, а также символов с кодом меньше 32.
en: Returns the Argument without trailing spaces and characters with the code less than 32.

source: UnixВремя - целое число секунд, прошедших с 1970-01-01T00:00:00Z; Вернуть_В_UTC - необязательный аргумент логического типа.
en: UnixTime - integer number of seconds elapsed since 1970-01-01T00:00:00Z; Return_In_UTC - an optional boolean parameter.

source: UnixToDateTime(UnixВремя[, Вернуть_В_UTC = True])
en: UnixToDateTime(UnixTime[, Return_In_UTC = True])

source: Возвращает дату и время по заданному Unix-времени. Если Вернуть_В_UTC = False, то результат вызова функции будет приведён к местному времени.
en: Returns date and time according to the specified Unix time. If Return_In_UTC = False, the result of the function call will be based on local time.

source: Upper(Аргумент)
en: Upper(Argument)

source: Возвращает аргумент в верхнем регистре.
en: Returns the uppercase argument.

source: Строка - строковое выражение. Десятичный_Разделитель - необязательный параметр строкового типа, используемый в качестве разделителя между целой и дробной частью числа. По умолчанию преобразование производится с учётом десятичного разделителя текущей локали пакета. Десятичный_Разделитель должен иметь длину в один символ. Разделитель_Групп_Разрядов - необязательный параметр строкового или логического типа, используемый для разделения групп разрядов в больших числах. Если Разделитель_Групп_Разрядов имеет строковый тип данных, то он должен быть длиной в один символ.
en: String - a string expression. Decimal_Separator - an optional string parameter used to separate the integer part of a number from the fractional part. By default, the convertion is made using the decimal separator of the current pckage locale. Decimal_Separator must be one character long. Thousands_Separator - an optional parameter of string or boolean types used to separate digit groups in large numbers. If Thousands_Separator is of a string type, it must be one character long.

source: Val(Строка[, Десятичный_Разделитель, Разделитель_Групп_Разрядов = True])
en: Val(String[, Decimal_Separator, Thousands_Separator = True])

source: Преобразует заданную строку в число с учётом параметров Десятичный_Разделитель и Разделитель_Групп_Разрядов. Если Разделитель_Групп_Разрядов не задан или равен True (истина), преобразование производится с учётом разделителя групп разрядов, указанного в текущей локали пакета. Если Разделитель_Групп_Разрядов равен False (ложь), то преобразование производится без учёта разделителей групп разрядов. Для параметров Десятичный_Разделитель и Разделитель_Групп_Разрядов допустимы все символы ASCII, кроме цифр, знаков + - и буквы E. Для Разделитель_Групп_Разрядов также допустим символ NBSP. Если параметры Десятичный_Разделитель и Разделитель_Групп_Разрядов заданы, то их значения не должны совпадать. Если задан только параметр Десятичный_Разделитель, то он не должен совпадать с разделителем групп разрядов, указанным в текущей локали пакета.
en: Converts the specified string to a number using the Decimal_Separator and Thousands_Separator parameters. If Thousands_Separator is not specified of is True, the string is converted using the thousands separator specified in the current package locale. If Thousands_Separator is False, the convertion does not employ thousands separators. The Decimal_Separator and Thousands_Separator parameters may be any ASCII characters except numbers, + and - characters and letter E. For Thousands_Separator, the NBSP character is also acceptable. In case the Decimal_Separator and Thousands_Separator parameters are set, their values must not be the same. If only the Decimal_Separator parameter is set, it must differ from the thousands separator specified in the current package locale.

source: Week(Дата)
en: Week(Date)

source: Возвращает номер недели в году по заданной дате в соответствии со стандартом ISO 8601, по которому неделя начинается с понедельника и заканчивается воскресеньем. Первой неделей года считается первая неделя по Григорианскому календарю, в которой есть четверг.
en: Returns the number of the given date's week within the year following the ISO 8601 standard, under which weeks start on Monday and end on Sunday. The first week of the year is the first week in the Gregorian calendar which includes a Thursday.

source: WeeksBetween(Дата1, Дата2[, Абсолютное_Значение = True])
en: WeeksBetween(Date1, Date2[, Absolute_Value = True])

source: Возвращает количество полных недель между двумя датами. Если Дата2 раньше Дата1 и Абсолютное_Значение = False, то будет возвращено отрицательное число полных временных промежутков между датами; если Абсолютное_Значение = True, то функция вернёт модуль значения
en: Returns the number of complete weeks between two dates. If Date2 is earlier than Date1 and Absolute_Value = False, the function will return the negative number of complete time spans between the dates; if Absolute_Value = True, the function will return the absolute value

source: Year(Дата)
en: Year(Date)

source: Возвращает год по заданной дате.
en: Returns the year according to the specified date.

source: YearsBetween(Дата1, Дата2[, Абсолютное_Значение = True])
en: YearsBetween(Date1, Date2[, Absolute_Value = True])

source: Возвращает количество полных лет между двумя датами. Если Дата2 раньше Дата1 и Абсолютное_Значение = False, то будет возвращено отрицательное число полных временных промежутков между датами; если Абсолютное_значение = True, то функция вернёт модуль значения
en: Returns the number of complete years between two dates. If Date2 is earlier than Date1 and Absolute_Value = False, the function will return the negative number of complete time spans between the dates; if Absolute_Value = True, the function will return the absolute value

source: Вх.Строка - входная строка, в которой будет искаться домен; Ном.Вхожд - порядковый номер домена в искомой строке.
en: InputString - the input string in which the domain name will be searched; OccurrenceNumber - the index of the domain name in the searched string.

source: RegExDomain(Вх.Строка [, Ном.Вхожд = 1])
en: RegExDomain(InputString [, OccurrenceNumber = 1])

source: Возвращает Ном.Вхожд-ое доменное имя из строки Вх.Строка, не включая www до домена 1-го уровня включительно. Для поиска используются регулярные выражения.
en: Returns the OccurrenceNumber-th domain name in the InputString, up to the top level domain, inclusively, not including www. Regular expressions are used for the search.

source: Вх.Строка - входная строка, в которой будет искаться email адрес; Ном.Вхожд - порядковый номер email адреса в искомой строке.
en: InputString - the input string in which the email address will be searched; OccurrenceNumber - the index of the email address in the searched string.

source: RegExEmail(Вх.Строка [, Ном.Вхожд = 1])
en: RegExEmail(InputString [, OccurrenceNumber = 1])

source: Извлекает Ном.Вхожд-й email адрес из строки Вх.Строка. Для поиска используются регулярные выражения.
en: Retrieves the OccurrenceNumber-th email address from the InputString. Regular expressions are used for the search.

source: Функция возвращает число строк в источнике данных.
en: Function returns the row count in the data source.

source: Функция возвращает число - значение CRC32, рассчитанное от заданной строки. Расчеты производятся над последовательностью символов Строки в кодировке UTF-8.
en: The function returns the numeric value of the CRC32 calculated from the given string. The String's character sequence is processed using UTF-8 encoding.

source: Рег.Выр. - строка регулярного выражения; Строка - входная строка.
en: RegularExpression - the regular expressions string; String - the input string.

source: RegExMatch(Рег.Выр., Строка)
en: RegExMatch(RegularExpression, String)

source: Проверяет соответствие строки регулярному выражению. Используется библиотека PCRE2. Синтаксис и семантика совместимы с регулярными выражениями Perl.
en: Checks if the string matches the regular expression. The PCRE2 library is used. Syntax and semantics are compatible with Perl regular expressions.

source: RegExMatchCount(Рег.Выр., Строка)
en: RegExMatchCount(RegularExpression, String)

source: Возвращает кол-во частей строки, соответствующих регулярному выражению. Используется библиотека PCRE2. Синтаксис и семантика совместимы с регулярными выражениями Perl.
en: Returns the number of the string parts matching the regular expression. PCRE2 library is used. Syntax and semantics are compatible with the Perl regular expressions.

source: Рег.Выр. - строка регулярного выражения; Строка - входная строка; НомерЧасти - порядковый номер соответствующей регулярному выражению части входной строки. Параметр должен входить в диапазон от 1 до RegExMatchCount.
en: RegularExpression - the regular expression string; String - the input string; MatchIndex - the index of the matched substring. The parameter must be within the range from 1 to RegExMatchCount.

source: RegExMatchedExp(Рег.Выр., Строка [, НомерЧасти = 1])
en: RegExMatchedExp(RegularExpression, String [, MatchIndex = 1])

source: Возвращает часть строки, соответствующую регулярному выражению. Используется библиотека PCRE2. Синтаксис и семантика совместимы с регулярными выражениями Perl.
en: Returns the string part matching the regular expression. PCRE2 library is used. Syntax and semantics are compatible with the Perl regular expressions.

source: Рег.Выр. - строка регулярного выражения; Строка - входная строка; ИмяГруппы - имя группы, определяемой метасимволами (...); НомерЧасти - порядковый номер соответствующей регулярному выражению части входной строки. Параметр должен входить в диапазон от 1 до RegExMatchCount.
en: RegularExpression - the regular expression string; String - the input string; GroupName - the name of the group defined by metacharacters (...); MatchIndex - the index of the matched substring. The parameter must be within the range from 1 to RegExMatchCount.

source: RegExMatchedNamedSubExp(Рег.Выр., Строка, ИмяГруппы [, НомерЧасти = 1])
en: RegExMatchedNamedSubExp(RegularExpression, String, GroupName [, MatchIndex = 1])

source: Возвращает именованную группу части строки, соответствующую регулярному выражению. Используется библиотека PCRE2. Синтаксис и семантика совместимы с регулярными выражениями Perl.
en: Returns the named string part group matching the regular expression. PCRE2 library is used. Syntax and semantics are compatible with the Perl regular expressions.

source: Рег.Выр. - строка регулярного выражения; Строка - входная строка; НомерГруппы - порядковый номер группы, определяемой метасимволами (...); НомерЧасти - порядковый номер соответствующей регулярному выражению части входной строки. Параметр должен входить в диапазон от 1 до RegExMatchCount.
en: RegularExpression - the regular expression string; String - the input string; GroupIndex - the index of the group defined by metacharacters (...); MatchIndex - the index of the matched substring. The parameter must be within the range from 1 to RegExMatchCount.

source: RegExMatchedSubExp(Рег.Выр., Строка, НомерГруппы [, НомерЧасти = 1])
en: RegExMatchedSubExp(RegularExpression, String, GroupIndex [, MatchIndex = 1])

source: Возвращает группу части строки, соответствующую регулярному выражению. Группы нумеруются слева направо, в порядке появления открывающихся скобок. Используется библиотека PCRE2. Синтаксис и семантика совместимы с регулярными выражениями Perl.
en: Returns the string part group matching the regular expression. Groups are numbered from left to right according to occurrence of opening brackets. PCRE2 library is used. Syntax and semantics are compatible with the Perl regular expressions.

source: Рег.Выр. - строка регулярного выражения; Вх.Строка - входная строка, которая будет подвержена замене; СтрокаЗамены - строка, которая будет вставлена вместо части входной строки, соответствующией регулярному выражению; НомерЧасти - порядковый номер соответствующей регулярному выражению части входной строки. Параметр должен входить в диапазон от 1 до RegExMatchCount; Расш.Синтаксис - расширенный синтаксис замены (используется библиотека PCRE2).
en: RegularExpression - the regular expression string; InputString - the input string that will be replaced; ReplaceString - the string that will be inserted instead of the input string part matching the regular expression; MatchIndex - the index of the matched substring. The parameter must be within the range from 1 to RegExMatchCount; ExtendedSyntax - extended replacement syntax (The PCRE2 library is used).

source: RegExReplace(Рег.Выр., Вх.Строка, СтрокаЗамены [, НомерЧасти = 1, Расш.Синтаксис = False])
en: RegExReplace(RegularExpression, InputString, ReplaceString [, MatchIndex = 1, ExtendedSyntax = False])
